K6-Tests/resultados/epica6-volume-phase3-50k.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: epica6-volume.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 3m0s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]
time="2026-03-02T17:18:16-03:00" level=info msg="Registrar filas antes de ejecutar: SELECT COUNT(*) FROM loans; SELECT COUNT(*) FROM kardex;" source=console

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 5 VUs  0m00.6s/3m0s

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 5 VUs  0m01.6s/3m0s

running (0m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 5 VUs  0m02.6s/3m0s

running (0m05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m03.6s/3m0s

running (0m06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m04.6s/3m0s

running (0m07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m05.6s/3m0s

running (0m08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 5 VUs  0m06.6s/3m0s

running (0m09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 5 VUs  0m07.6s/3m0s

running (0m10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m08.6s/3m0s

running (0m11.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m09.6s/3m0s

running (0m12.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  0m10.6s/3m0s

running (0m13.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  0m11.6s/3m0s

running (0m14.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m12.6s/3m0s

running (0m15.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m13.6s/3m0s

running (0m16.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m14.6s/3m0s

running (0m17.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  0m15.6s/3m0s

running (0m18.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  0m16.6s/3m0s

running (0m19.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m17.6s/3m0s

running (0m20.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m18.6s/3m0s

running (0m21.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  11% ] 5 VUs  0m19.6s/3m0s

running (0m22.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  11% ] 5 VUs  0m20.6s/3m0s

running (0m23.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m21.6s/3m0s

running (0m24.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m22.6s/3m0s

running (0m25.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m23.6s/3m0s

running (0m26.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  14% ] 5 VUs  0m24.6s/3m0s

running (0m27.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  14% ] 5 VUs  0m25.6s/3m0s

running (0m28.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m26.6s/3m0s

running (0m29.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m27.6s/3m0s

running (0m30.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  0m28.6s/3m0s

running (0m31.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  0m29.6s/3m0s

running (0m32.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m30.6s/3m0s

running (0m33.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m31.6s/3m0s

running (0m34.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m32.6s/3m0s

running (0m35.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  0m33.6s/3m0s

running (0m36.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  0m34.6s/3m0s

running (0m37.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  0m35.6s/3m0s

running (0m38.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  0m36.6s/3m0s

running (0m39.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  0m37.6s/3m0s

running (0m40.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  0m38.6s/3m0s

running (0m41.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  0m39.6s/3m0s

running (0m42.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  0m40.6s/3m0s

running (0m43.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  0m41.6s/3m0s

running (0m44.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  24% ] 5 VUs  0m42.6s/3m0s

running (0m45.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  24% ] 5 VUs  0m43.6s/3m0s

running (0m46.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  0m44.6s/3m0s

running (0m47.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  0m45.6s/3m0s

running (0m48.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  0m46.6s/3m0s

running (0m49.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  0m47.6s/3m0s

running (0m50.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  0m48.6s/3m0s

running (0m51.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  0m49.6s/3m0s

running (0m52.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  0m50.6s/3m0s

running (0m53.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  0m51.6s/3m0s

running (0m54.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  0m52.6s/3m0s

running (0m55.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  0m53.6s/3m0s

running (0m56.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  0m54.6s/3m0s

running (0m57.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  31% ] 5 VUs  0m55.6s/3m0s

running (0m58.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  31% ] 5 VUs  0m56.6s/3m0s

running (0m59.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  0m57.6s/3m0s

running (1m00.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  0m58.6s/3m0s

running (1m01.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  0m59.6s/3m0s

running (1m02.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  1m00.6s/3m0s

running (1m03.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  1m01.6s/3m0s

running (1m04.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  1m02.6s/3m0s

running (1m05.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  1m03.6s/3m0s

running (1m06.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  1m04.6s/3m0s

running (1m07.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  1m05.6s/3m0s

running (1m08.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  1m06.6s/3m0s

running (1m09.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  1m07.6s/3m0s

running (1m10.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  1m08.6s/3m0s

running (1m11.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  1m09.6s/3m0s

running (1m12.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  1m10.6s/3m0s

running (1m13.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  1m11.6s/3m0s

running (1m14.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  1m12.6s/3m0s

running (1m15.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  41% ] 5 VUs  1m13.6s/3m0s

running (1m16.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  41% ] 5 VUs  1m14.6s/3m0s

running (1m17.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  1m15.6s/3m0s

running (1m18.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  1m16.6s/3m0s

running (1m19.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  1m17.6s/3m0s

running (1m20.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  44% ] 5 VUs  1m18.6s/3m0s

running (1m21.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  44% ] 5 VUs  1m19.6s/3m0s

running (1m22.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  1m20.6s/3m0s

running (1m23.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  1m21.6s/3m0s

running (1m24.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  1m22.6s/3m0s

running (1m25.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  1m23.6s/3m0s

running (1m26.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  1m24.6s/3m0s

running (1m27.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  1m25.6s/3m0s

running (1m28.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  1m26.6s/3m0s

running (1m29.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  1m27.6s/3m0s

running (1m30.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  1m28.6s/3m0s

running (1m31.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  1m29.6s/3m0s

running (1m32.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  1m30.6s/3m0s

running (1m33.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  51% ] 5 VUs  1m31.6s/3m0s

running (1m34.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  51% ] 5 VUs  1m32.6s/3m0s

running (1m35.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  1m33.6s/3m0s

running (1m36.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  1m34.6s/3m0s

running (1m37.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  1m35.6s/3m0s

running (1m38.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  54% ] 5 VUs  1m36.6s/3m0s

running (1m39.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  54% ] 5 VUs  1m37.6s/3m0s

running (1m40.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  1m38.6s/3m0s

running (1m41.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  1m39.6s/3m0s

running (1m42.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  1m40.6s/3m0s

running (1m43.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  1m41.6s/3m0s

running (1m44.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  1m42.6s/3m0s

running (1m45.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  1m43.6s/3m0s

running (1m46.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  1m44.6s/3m0s

running (1m47.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  1m45.6s/3m0s

running (1m48.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  1m46.6s/3m0s

running (1m49.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  1m47.6s/3m0s

running (1m50.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  1m48.6s/3m0s

running (1m51.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
default   [  61% ] 5 VUs  1m49.6s/3m0s

running (1m52.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  61% ] 5 VUs  1m50.6s/3m0s

running (1m53.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  1m51.6s/3m0s

running (1m54.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  1m52.6s/3m0s

running (1m55.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  1m53.6s/3m0s

running (1m56.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  64% ] 5 VUs  1m54.6s/3m0s

running (1m57.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  64% ] 5 VUs  1m55.6s/3m0s

running (1m58.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  1m56.6s/3m0s

running (1m59.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  1m57.6s/3m0s

running (2m00.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  1m58.6s/3m0s

running (2m01.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  1m59.6s/3m0s

running (2m02.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  2m00.6s/3m0s

running (2m03.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  2m01.6s/3m0s

running (2m04.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  2m02.6s/3m0s

running (2m05.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  2m03.6s/3m0s

running (2m06.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  2m04.6s/3m0s

running (2m07.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  2m05.6s/3m0s

running (2m08.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  2m06.6s/3m0s

running (2m09.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  71% ] 5 VUs  2m07.6s/3m0s

running (2m10.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  71% ] 5 VUs  2m08.6s/3m0s

running (2m11.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  2m09.6s/3m0s

running (2m12.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  2m10.6s/3m0s

running (2m13.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  2m11.6s/3m0s

running (2m14.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  74% ] 5 VUs  2m12.6s/3m0s

running (2m15.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  74% ] 5 VUs  2m13.6s/3m0s

running (2m16.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  2m14.6s/3m0s

running (2m17.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  2m15.6s/3m0s

running (2m18.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  2m16.6s/3m0s

running (2m19.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  2m17.6s/3m0s

running (2m20.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  2m18.6s/3m0s

running (2m21.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  2m19.6s/3m0s

running (2m22.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  2m20.6s/3m0s

running (2m23.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  2m21.6s/3m0s

running (2m24.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  2m22.6s/3m0s

running (2m25.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  2m23.6s/3m0s

running (2m26.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  2m24.6s/3m0s

running (2m27.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  81% ] 5 VUs  2m25.6s/3m0s

running (2m28.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  81% ] 5 VUs  2m26.6s/3m0s

running (2m29.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  2m27.6s/3m0s

running (2m30.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  2m28.6s/3m0s

running (2m31.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  2m29.6s/3m0s

running (2m32.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  84% ] 5 VUs  2m30.6s/3m0s

running (2m33.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  84% ] 5 VUs  2m31.6s/3m0s

running (2m34.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  2m32.6s/3m0s

running (2m35.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  2m33.6s/3m0s

running (2m36.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  2m34.6s/3m0s

running (2m37.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  2m35.6s/3m0s

running (2m38.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  2m36.6s/3m0s

running (2m39.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  2m37.6s/3m0s

running (2m40.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  2m38.6s/3m0s

running (2m41.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  2m39.6s/3m0s

running (2m42.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  2m40.6s/3m0s

running (2m43.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  2m41.6s/3m0s

running (2m44.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  2m42.6s/3m0s

running (2m45.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  91% ] 5 VUs  2m43.6s/3m0s

running (2m46.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
default   [  91% ] 5 VUs  2m44.6s/3m0s

running (2m47.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  2m45.6s/3m0s

running (2m48.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  2m46.6s/3m0s

running (2m49.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  2m47.6s/3m0s

running (2m50.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  94% ] 5 VUs  2m48.6s/3m0s

running (2m51.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  94% ] 5 VUs  2m49.6s/3m0s

running (2m52.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  2m50.6s/3m0s

running (2m53.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  2m51.6s/3m0s

running (2m54.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  2m52.6s/3m0s

running (2m55.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  2m53.6s/3m0s

running (2m56.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  2m54.6s/3m0s

running (2m57.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  2m55.6s/3m0s

running (2m58.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  2m56.6s/3m0s

running (2m59.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  2m57.6s/3m0s

running (3m00.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  2m58.6s/3m0s

running (3m01.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  2m59.6s/3m0s

running (3m02.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  3m0s

running (3m03.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  3m0s

running (3m04.0s), 4/5 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  3m0s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(95)<10000' p(95)=36.63ms

    kardex_full_duration
    ✓ 'p(95)<10000' p(95)=22.8ms

    ranking_duration
    ✓ 'p(95)<10000' p(95)=30.47ms


  █ TOTAL RESULTS 

    checks_total.......: 900     4.881906/s
    checks_succeeded...: 100.00% 900 out of 900
    checks_failed......: 0.00%   0 out of 900

    ✓ kardex/paginated → 200
    ✓ kardex/filter?type → 200
    ✓ kardex/filter?fechas → 200
    ✓ kardex/ranking/paginated → 200
    ✓ kardex/ranking/range/paginated → 200
    ✓ user/clients → 200
    ✓ user/employees → 200
    ✓ loan/paginated p.0 → 200
    ✓ loan/paginated p.5 → 200

    CUSTOM
    client_full_duration...........: avg=5.66ms  min=1.26ms med=5.71ms  max=10.13ms p(90)=8.3ms   p(95)=9.16ms 
    employee_full_duration.........: avg=6.43ms  min=2.03ms med=6.46ms  max=10.7ms  p(90)=9.14ms  p(95)=9.67ms 
    failed_requests................: 0.00%  0 out of 900
    kardex_filter_duration.........: avg=23.1ms  min=4.18ms med=20.57ms max=55.12ms p(90)=40.73ms p(95)=44.01ms
    kardex_full_duration...........: avg=16.26ms min=5.94ms med=16.15ms max=29.52ms p(90)=20.48ms p(95)=22.8ms 
    loan_paginated_duration........: avg=14.7ms  min=5.13ms med=15.17ms max=21.56ms p(90)=18.89ms p(95)=19.42ms
    ranking_duration...............: avg=16.54ms min=2.37ms med=16.15ms max=35.26ms p(90)=28.93ms p(95)=30.47ms

    HTTP
    http_req_duration..............: avg=15.25ms min=1.26ms med=12.81ms max=55.12ms p(90)=29.9ms  p(95)=36.63ms
      { expected_response:true }...: avg=15.25ms min=1.26ms med=12.81ms max=55.12ms p(90)=29.9ms  p(95)=36.63ms
    http_req_failed................: 0.00%  0 out of 901
    http_reqs......................: 901    4.88733/s

    EXECUTION
    iteration_duration.............: avg=9.14s   min=9.1s   med=9.14s   max=9.18s   p(90)=9.17s   p(95)=9.17s  
    iterations.....................: 100    0.542434/s
    vus............................: 4      min=0        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 5.7 MB 31 kB/s
    data_sent......................: 83 kB  452 B/s



running (3m04.4s), 0/5 VUs, 100 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  3m0s